pschatzmann/stm32-sai/src/STM32DriverF723.h
#pragma once

#ifdef STM32F723xx
#include "DriverConfig.h"
#include "PinConfig.h"
#include "stm32f7xx.h"
#include "stm32f7xx_hal.h"

#define SAI_SUPPORT 1

// Pin configuration for the STM32F723E-Discovery's WM8994 codec on SAI2.
// Matches the ST BSP (stm32f723e_discovery_audio.h): Block A = TX/out on
// PI4 (MCLK)/PI5 (SCK)/PI6 (SD)/PI7 (FS); Block B = RX/in, SD on PG10.
// All AF10 (GPIO_AF10_SAI2).
static const PinConfig F723_SAI_DEFAULT_PINS[5] = {
  {digitalPinToPinName(PI5), 10},   // SCK
  {digitalPinToPinName(PI7), 10},   // FS
  {digitalPinToPinName(PI6), 10},   // SD (TX/out)
  {digitalPinToPinName(PG10), 10},  // SD_RX (RX/in, Block B)
  {digitalPinToPinName(PI4), 10}    // MCLK
};

static const SAIPinCandidate F723_SAI_ALLOWED_PINS[] = {
    {PinId::SCK, {digitalPinToPinName(PD13), 10}},
    {PinId::SCK, {digitalPinToPinName(PI5), 10}},
    {PinId::FS, {digitalPinToPinName(PD12), 10}},
    {PinId::FS, {digitalPinToPinName(PI7), 10}},
    {PinId::SD, {digitalPinToPinName(PD11), 10}},
    {PinId::SD, {digitalPinToPinName(PI6), 10}},
    {PinId::SD_RX, {digitalPinToPinName(PA0), 10}},
    {PinId::SD_RX, {digitalPinToPinName(PE11), 10}},
    {PinId::SD_RX, {digitalPinToPinName(PF11), 10}},
    {PinId::SD_RX, {digitalPinToPinName(PG10), 10}},
    {PinId::MCLK, {digitalPinToPinName(PE0), 10}},
    {PinId::MCLK, {digitalPinToPinName(PI4), 10}},
};

/// Board-specific driver config for the STM32F723E-Discovery (SAI2, TX and
/// RX on separate blocks/pins - supports Output, Input, and Duplex modes).
/// enableSAIClocks below picks the right PLLI2S profile per sample-rate
/// family, matching the ST BSP.
/// const gives this internal linkage per translation unit (C++ default for
/// namespace-scope const globals) - both STM32AudioSAI.cpp and this file's
/// own .cpp transitively include this header, so without const each would
/// get its own externally-linked SAI_CONFIG and the linker would reject it
/// as a duplicate definition.
const STM32SAIDriverConfig SAI_CONFIG = {
    SAI2_Block_A,                            // sai_block_tx
    DMA2_Stream4,                            // dma_tx_instance
    DMA_CHANNEL_3,                           // dma_tx_request (-> Init.Channel, no DMAMUX on F7)
    DMA2_Stream4_IRQn,                       // dma_tx_irq
    SAI2_Block_B,                            // sai_block_rx
    DMA2_Stream6,                            // dma_rx_instance
    DMA_CHANNEL_3,                           // dma_rx_request (-> Init.Channel)
    DMA2_Stream6_IRQn,                       // dma_rx_irq
    F723_SAI_DEFAULT_PINS,                       // defaultPins
    sizeof(F723_SAI_DEFAULT_PINS) / sizeof(PinConfig),  // numPins
    F723_SAI_ALLOWED_PINS,                       // allowedPins
    sizeof(F723_SAI_ALLOWED_PINS) / sizeof(SAIPinCandidate),  // numAllowedPins
    [](uint32_t sample_rate) {
      // enableSAIClocks: route SAI2 from PLLI2S, per the ST BSP's
      // BSP_AUDIO_OUT_ClockConfig(). The BSP uses one PLLI2S profile for the
      // 44.1kHz sample-rate family (11025/22050/44100 Hz) and a different
      // one for the 48kHz family (8000/16000/32000/48000/96000 Hz) - pick
      // between them based on the actual requested sample_rate instead of
      // hardcoding one, so both families get an accurate audio clock.
      STM32AudioLogger::instance().debugf("enable SAI2 clocks for %u Hz",
                                           (unsigned)sample_rate);
      RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};
      PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SAI2;
      PeriphClkInitStruct.Sai2ClockSelection = RCC_SAI2CLKSOURCE_PLLI2S;
      switch (sample_rate) {
        case 11025:
        case 22050:
        case 44100:
          // PLLSAI_VCO/PLLI2SQ = 429/2 = 214.5MHz, /PLLI2SDivQ(19) = 11.289MHz
          PeriphClkInitStruct.PLLI2S.PLLI2SN = 429;
          PeriphClkInitStruct.PLLI2S.PLLI2SQ = 2;
          PeriphClkInitStruct.PLLI2SDivQ = 19;
          break;
        case 8000:
        case 16000:
        case 32000:
        case 48000:
        case 96000:
        default:
          // PLLSAI_VCO/PLLI2SQ = 344/7 = 49.142MHz, /PLLI2SDivQ(1) = 49.142MHz
          PeriphClkInitStruct.PLLI2S.PLLI2SN = 344;
          PeriphClkInitStruct.PLLI2S.PLLI2SQ = 7;
          PeriphClkInitStruct.PLLI2SDivQ = 1;
          break;
      }
      if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK) {
        STM32AudioLogger::instance().error("SAI2 clock configuration failed");
      }
      __HAL_RCC_SAI2_CLK_ENABLE();
    },
    []() {
      // disableSAIClocks
      STM32AudioLogger::instance().debug("disable SAI2 clocks");
      __HAL_RCC_SAI2_CLK_DISABLE();
    },
    []() {
      // enableDMAClocks
      STM32AudioLogger::instance().debug("enable DMA2 clocks");
      __HAL_RCC_DMA2_CLK_ENABLE();
    },
    []() {
      // disableDMAClocks
      STM32AudioLogger::instance().debug("disable DMA2 clocks");
      __HAL_RCC_DMA2_CLK_DISABLE();
    }};

#endif
